[Killed] Block removal mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:28:9
 
         public AuthController(IConfiguration configuration, ApplicationDbContext dbContext, 
             ILogger<AuthController> logger, IHttpClientFactory httpClientFactory)
-        {
-            _configuration = configuration;
-            _dbContext = dbContext;
-            _logger = logger;
-            _httpClient = httpClientFactory.CreateClient();
-        }
+        {}
 
         [HttpPost("google")]
killedBy: pyWeb_ScaeUPT.Tests.Integration.IntegrationTests.Post_AuthGoogle_ReturnsBadRequestForInvalidToken; pyWeb_ScaeUPT.Tests.Controllers.AuthControllerTests.Google_InvalidToken_ReturnsBadRequest; pyWeb_ScaeUPT.Tests.Controllers.AuthControllerTests.Google_ValidToken_ReturnsOkWithJWT

[Survived] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:40:17
         {
             try
             {
-                _logger.LogInformation($"Received Google ID token: {request.IdToken}");
+                ;
                 
                 // Verificar el token de Google

[Survived] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:40:40
         {
             try
             {
-                _logger.LogInformation($"Received Google ID token: {request.IdToken}");
+                _logger.LogInformation($"");
                 
                 // Verificar el token de Google

[Killed] Equality mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:44:21
                 
                 // Verificar el token de Google
                 var payload = await VerifyGoogleToken(request.IdToken);
-                if (payload == null)
+                if (payload != null)
                 {
                     return BadRequest(new { error = "Token de Google inválido" });
killedBy: pyWeb_ScaeUPT.Tests.Integration.IntegrationTests.Post_AuthGoogle_ReturnsBadRequestForInvalidToken; pyWeb_ScaeUPT.Tests.Controllers.AuthControllerTests.Google_InvalidToken_ReturnsBadRequest; pyWeb_ScaeUPT.Tests.Controllers.AuthControllerTests.Google_ValidToken_ReturnsOkWithJWT

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:50:21
                 }
 
                 // Verificar si el correo pertenece al dominio institucional
-                if (!payload.Email.EndsWith("@virtual.upt.pe"))
+                if (payload.Email.EndsWith("@virtual.upt.pe"))
                 {
                     return BadRequest(new { error = "Solo se permite el acceso con cuentas del dominio virtual.upt.pe" });
killedBy: pyWeb_ScaeUPT.Tests.Controllers.AuthControllerTests.Google_ValidToken_ReturnsOkWithJWT; pyWeb_ScaeUPT.Tests.Controllers.AuthControllerTests.Google_InvalidDomain_ReturnsBadRequest

[Killed] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:50:45
                 }
 
                 // Verificar si el correo pertenece al dominio institucional
-                if (!payload.Email.EndsWith("@virtual.upt.pe"))
+                if (!payload.Email.EndsWith(""))
                 {
                     return BadRequest(new { error = "Solo se permite el acceso con cuentas del dominio virtual.upt.pe" });
killedBy: pyWeb_ScaeUPT.Tests.Controllers.AuthControllerTests.Google_InvalidDomain_ReturnsBadRequest

[Killed] Equality mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:58:21
                 // Buscar o crear el usuario en la base de datos
                 var usuario = await BuscarEstudiante(payload);
 
-                if (usuario == null)
+                if (usuario != null)
                 {
                     return BadRequest(new { error = "El correo no está registrado en el sistema" });
killedBy: pyWeb_ScaeUPT.Tests.Controllers.AuthControllerTests.Google_ValidToken_ReturnsOkWithJWT

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:60:53
 
                 if (usuario == null)
                 {
-                    return BadRequest(new { error = "El correo no está registrado en el sistema" });
+                    return BadRequest(new { error = "" });
                 }
 

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:80:17
             }
             catch (Exception ex)
             {
-                _logger.LogError(ex, "Error en la autenticación con Google");
+                ;
                 return StatusCode(500, new { error = "Error en la autenticación", message = ex.Message });
             }

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:80:38
             }
             catch (Exception ex)
             {
-                _logger.LogError(ex, "Error en la autenticación con Google");
+                _logger.LogError(ex, "");
                 return StatusCode(500, new { error = "Error en la autenticación", message = ex.Message });
             }

[Survived] Boolean mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:90:37
         public IActionResult ValidateToken()
         {
             // validación se hace autoamticamente por el middleware de auth
-            return Ok(new { valid = true });
+            return Ok(new { valid = false });
         }
 

[Killed] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:99:21
             {
                 // Verificar el token con la API de Google
                 var response = await _httpClient.GetAsync(
-                    $"https://oauth2.googleapis.com/tokeninfo?id_token={idToken}");
+                    $"");
 
                 if (!response.IsSuccessStatusCode)
killedBy: pyWeb_ScaeUPT.Tests.Controllers.AuthControllerTests.Google_ValidToken_ReturnsOkWithJWT; pyWeb_ScaeUPT.Tests.Controllers.AuthControllerTests.Google_InvalidDomain_ReturnsBadRequest

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:101:21
                 var response = await _httpClient.GetAsync(
                     $"https://oauth2.googleapis.com/tokeninfo?id_token={idToken}");
 
-                if (!response.IsSuccessStatusCode)
+                if (response.IsSuccessStatusCode)
                 {
                     _logger.LogWarning($"Google token verification failed with status: {response.StatusCode}");
killedBy: pyWeb_ScaeUPT.Tests.Controllers.AuthControllerTests.Google_ValidToken_ReturnsOkWithJWT; pyWeb_ScaeUPT.Tests.Controllers.AuthControllerTests.Google_InvalidDomain_ReturnsBadRequest

[Survived] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:103:21
 
                 if (!response.IsSuccessStatusCode)
                 {
-                    _logger.LogWarning($"Google token verification failed with status: {response.StatusCode}");
+                    ;
                     return null;
                 }

[Killed] Object initializer mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:110:31
                 var content = await response.Content.ReadAsStringAsync();
                 //_logger.LogInformation($"Google token response: {content}");
                 
-                var options = new JsonSerializerOptions
-                {
-                    PropertyNameCaseInsensitive = true
-                };
+                var options = new JsonSerializerOptions
+{};
                 
                 var payload = JsonSerializer.Deserialize<GoogleTokenPayload>(content, options);
killedBy: pyWeb_ScaeUPT.Tests.Controllers.AuthControllerTests.Google_ValidToken_ReturnsOkWithJWT; pyWeb_ScaeUPT.Tests.Controllers.AuthControllerTests.Google_InvalidDomain_ReturnsBadRequest

[Killed] Equality mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:118:21
                 var payload = JsonSerializer.Deserialize<GoogleTokenPayload>(content, options);
 
                 // Verificar token fue emitido
-                if (payload.Aud != _configuration["Authentication:Google:ClientId"])
+                if (payload.Aud == _configuration["Authentication:Google:ClientId"])
                 {
                     _logger.LogWarning($"Token audience mismatch. Expected: {_configuration["Authentication:Google:ClientId"]}, Got: {payload.Aud}");
killedBy: pyWeb_ScaeUPT.Tests.Controllers.AuthControllerTests.Google_ValidToken_ReturnsOkWithJWT; pyWeb_ScaeUPT.Tests.Controllers.AuthControllerTests.Google_InvalidDomain_ReturnsBadRequest

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:120:21
                 // Verificar token fue emitido
                 if (payload.Aud != _configuration["Authentication:Google:ClientId"])
                 {
-                    _logger.LogWarning($"Token audience mismatch. Expected: {_configuration["Authentication:Google:ClientId"]}, Got: {payload.Aud}");
+                    ;
                     return null;
                 }

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:120:93
                 // Verificar token fue emitido
                 if (payload.Aud != _configuration["Authentication:Google:ClientId"])
                 {
-                    _logger.LogWarning($"Token audience mismatch. Expected: {_configuration["Authentication:Google:ClientId"]}, Got: {payload.Aud}");
+                    _logger.LogWarning($"Token audience mismatch. Expected: {_configuration[""]}, Got: {payload.Aud}");
                     return null;
                 }

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:128:17
             }
             catch (Exception ex)
             {
-                _logger.LogError(ex, "Error verifying Google token");
+                ;
                 return null;
             }

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:128:38
             }
             catch (Exception ex)
             {
-                _logger.LogError(ex, "Error verifying Google token");
+                _logger.LogError(ex, "");
                 return null;
             }

[Survived] Linq method mutation (FirstOrDefault() to First())
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:136:30
         private async Task<estudianteModel> BuscarEstudiante(GoogleTokenPayload payload)
         {
             // Buscar estudiante por correo
-            var estudiante = _dbContext.estudiante
-                .FirstOrDefault(e => e.Correo == payload.Email);
+            var estudiante = _dbContext.estudiante
+                .First(e => e.Correo == payload.Email);
 
             return estudiante;

[Killed] Equality mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:137:38
         {
             // Buscar estudiante por correo
             var estudiante = _dbContext.estudiante
-                .FirstOrDefault(e => e.Correo == payload.Email);
+                .FirstOrDefault(e => e.Correo != payload.Email);
 
             return estudiante;
killedBy: pyWeb_ScaeUPT.Tests.Controllers.AuthControllerTests.Google_ValidToken_ReturnsOkWithJWT

[Survived] Null coalescing mutation (remove left)
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:145:17
         private string GenerarJWT(estudianteModel usuario)
         {
             var key = new SymmetricSecurityKey(Encoding.UTF8.GetBytes(
-                _configuration["JWT:SecretKey"] ?? Environment.GetEnvironmentVariable("JWT_SECRET_KEY")));
+                Environment.GetEnvironmentVariable("JWT_SECRET_KEY")));
             var creds = new SigningCredentials(key, SecurityAlgorithms.HmacSha256);
 

[Survived] Null coalescing mutation (remove right)
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:145:17
         private string GenerarJWT(estudianteModel usuario)
         {
             var key = new SymmetricSecurityKey(Encoding.UTF8.GetBytes(
-                _configuration["JWT:SecretKey"] ?? Environment.GetEnvironmentVariable("JWT_SECRET_KEY")));
+                _configuration["JWT:SecretKey"]));
             var creds = new SigningCredentials(key, SecurityAlgorithms.HmacSha256);
 

[Survived] Null coalescing mutation (remove left)
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:156:25
             };
 
             var token = new JwtSecurityToken(
-                issuer: _configuration["JWT:Issuer"] ?? "pyWeb_ScaeUPT",
+                issuer: "pyWeb_ScaeUPT",
                 audience: _configuration["JWT:Audience"] ?? "pyWeb_ScaeUPT_Clients",
                 claims: claims,

[Survived] Null coalescing mutation (remove left)
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:157:27
 
             var token = new JwtSecurityToken(
                 issuer: _configuration["JWT:Issuer"] ?? "pyWeb_ScaeUPT",
-                audience: _configuration["JWT:Audience"] ?? "pyWeb_ScaeUPT_Clients",
+                audience: "pyWeb_ScaeUPT_Clients",
                 claims: claims,
                 expires: DateTime.Now.AddDays(1),

[Survived] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/AuthController.cs:157:42
 
             var token = new JwtSecurityToken(
                 issuer: _configuration["JWT:Issuer"] ?? "pyWeb_ScaeUPT",
-                audience: _configuration["JWT:Audience"] ?? "pyWeb_ScaeUPT_Clients",
+                audience: _configuration[""] ?? "pyWeb_ScaeUPT_Clients",
                 claims: claims,
                 expires: DateTime.Now.AddDays(1),
