[Killed] Block removal mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:24:9
         private readonly string _encryptionKey = "ScaeUPT2024SecretKey123456789012345";
 
         public HomeController(ILogger<HomeController> logger, ApplicationDbContext dbContext)
-        {
-            _logger = logger;
-            _dbContext = dbContext;
-        }
+        {}
 
         [HttpGet]

[Killed] Equality mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:39:17
         public IActionResult GetEstudiante(int id)
         {
             var estudiante = _dbContext.estudiante.Find(id);
-            if (estudiante == null) return NotFound();
+            if (estudiante != null) return NotFound();
             return Ok(estudiante);
         }
killedBy: pyWeb_ScaeUPT.Tests.Integration.IntegrationTests.Get_EstudianteEndpoint_ReturnsNotFoundForInvalidId; pyWeb_ScaeUPT.Tests.Integration.IntegrationTests.Get_EstudianteEndpoint_ReturnsSuccessForValidId; pyWeb_ScaeUPT.Tests.Controllers.HomeControllerTests.GetEstudiante_ExistingId_ReturnsOk

[Killed] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:51:21
             {
                 // Obtener el ID del usuario desde el token JWT
                 var userId = User.FindFirst(ClaimTypes.NameIdentifier)?.Value;
-                if (string.IsNullOrEmpty(userId) || !int.TryParse(userId, out int id))
+                if ((userId!=null) || !int.TryParse(userId, out int id))
                 {
                     return BadRequest("ID de usuario no válido");
killedBy: pyWeb_ScaeUPT.Tests.Controllers.HomeControllerTests.GetUserInfo_ValidUser_ReturnsOk

[Killed] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:51:21
             {
                 // Obtener el ID del usuario desde el token JWT
                 var userId = User.FindFirst(ClaimTypes.NameIdentifier)?.Value;
-                if (string.IsNullOrEmpty(userId) || !int.TryParse(userId, out int id))
+                if ((userId!="") || !int.TryParse(userId, out int id))
                 {
                     return BadRequest("ID de usuario no válido");
killedBy: pyWeb_ScaeUPT.Tests.Controllers.HomeControllerTests.GetUserInfo_ValidUser_ReturnsOk

[Survived] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:53:39
                 var userId = User.FindFirst(ClaimTypes.NameIdentifier)?.Value;
                 if (string.IsNullOrEmpty(userId) || !int.TryParse(userId, out int id))
                 {
-                    return BadRequest("ID de usuario no válido");
+                    return BadRequest("");
                 }
 

[Killed] Equality mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:58:21
 
                 // Buscar el estudiante en la base de datos
                 var estudiante = _dbContext.estudiante.Find(id);
-                if (estudiante == null) return NotFound("Estudiante no encontrado");
+                if (estudiante != null) return NotFound("Estudiante no encontrado");
 
                 // Obtener el correo del token
killedBy: pyWeb_ScaeUPT.Tests.Controllers.HomeControllerTests.GetUserInfo_ValidUser_ReturnsOk

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:76:17
             }
             catch (Exception ex)
             {
-                _logger.LogError(ex, "Error al obtener información del usuario");
+                ;
                 return StatusCode(500, "Error interno del servidor");
             }

[NoCoverage] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:76:38
             }
             catch (Exception ex)
             {
-                _logger.LogError(ex, "Error al obtener información del usuario");
+                _logger.LogError(ex, "");
                 return StatusCode(500, "Error interno del servidor");
             }

[Survived] String mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:105:76
                 DateTime limaTime;
                 try
                 {
-                    var limaTimeZone = TimeZoneInfo.FindSystemTimeZoneById("SA Pacific Standard Time");
+                    var limaTimeZone = TimeZoneInfo.FindSystemTimeZoneById("");
                     limaTime = TimeZoneInfo.ConvertTimeFromUtc(DateTime.UtcNow, limaTimeZone);
                 }

[NoCoverage] UnaryMinusExpression to UnaryPlusExpression mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:111:57
                 catch (TimeZoneNotFoundException)
                 {
                     // Fallback para entornos de prueba donde la zona horaria puede no estar disponible
-                    limaTime = DateTime.UtcNow.AddHours(-5); // UTC-5 para Lima
+                    limaTime = DateTime.UtcNow.AddHours(+5); // UTC-5 para Lima
                 }
                 

[Killed] Equality mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:125:74
                 string encryptedToken = EncryptData(dataToEncrypt);
 
                 // Crear o actualizar el registro en la tabla de tokens
-                var existingToken = _dbContext.token.FirstOrDefault(t => t.DNI_token == dniToEncrypt);
+                var existingToken = _dbContext.token.FirstOrDefault(t => t.DNI_token != dniToEncrypt);
                 if (existingToken != null)
                 {

[Killed] Linq method mutation (FirstOrDefault() to First())
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:125:37
                 string encryptedToken = EncryptData(dataToEncrypt);
 
                 // Crear o actualizar el registro en la tabla de tokens
-                var existingToken = _dbContext.token.FirstOrDefault(t => t.DNI_token == dniToEncrypt);
+                var existingToken = _dbContext.token.First(t => t.DNI_token == dniToEncrypt);
                 if (existingToken != null)
                 {
killedBy: pyWeb_ScaeUPT.Tests.Controllers.HomeControllerTests.GenerateQR_ValidUser_ReturnsOk

[Killed] Equality mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:126:21
 
                 // Crear o actualizar el registro en la tabla de tokens
                 var existingToken = _dbContext.token.FirstOrDefault(t => t.DNI_token == dniToEncrypt);
-                if (existingToken != null)
+                if (existingToken == null)
                 {
                     // Actualizar token existente
killedBy: pyWeb_ScaeUPT.Tests.Controllers.HomeControllerTests.GenerateQR_ValidUser_ReturnsOk

[Killed] Object initializer mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:133:42
                 }
                 else
                 {
-                    _dbContext.token.Add(new tokenModel
-                    {
-                        DNI_token = dniToEncrypt,
-                        Token = encryptedToken
-                    });
+                    _dbContext.token.Add(new tokenModel
+{});
                 }
 
killedBy: pyWeb_ScaeUPT.Tests.Controllers.HomeControllerTests.GenerateQR_ValidUser_ReturnsOk

[Killed] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:140:17
                     });
                 }
 
-                _dbContext.SaveChanges();
+                ;
 
                 // Generar el código QR

[Survived] Boolean mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:146:31
                 string qrCodeBase64 = GenerateQRCodeBase64(encryptedToken);
 
                 return Ok(new { 
-                    success = true, 
+                    success = false, 
                     timestamp = limaTime.ToString("dd/MM/yyyy HH:mm:ss"),
                     qrData = encryptedToken,

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:154:17
             }
             catch (Exception ex)
             {
-                _logger.LogError(ex, "Error al generar código QR");
+                ;
                 return StatusCode(500, "Error interno del servidor");
             }

[Survived] Block removal mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:256:21
                 {
                     QRCodeData qrCodeData = qrGenerator.CreateQrCode(data, QRCodeGenerator.ECCLevel.Q);
                     using (PngByteQRCode qrCode = new PngByteQRCode(qrCodeData))
-                    {
-                        byte[] qrCodeImage = qrCode.GetGraphic(20);
-                        return Convert.ToBase64String(qrCodeImage);
-                    }
+                    {}
                 }
             }

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:264:17
             }
             catch (Exception ex)
             {
-                _logger.LogError(ex, "Error al generar código QR como Base64");
+                ;
                 throw;
             }

[NoCoverage] Statement mutation
WebApp/pyWeb_ScaeUPT/Controllers/HomeController.cs:265:17
             catch (Exception ex)
             {
                 _logger.LogError(ex, "Error al generar código QR como Base64");
-                throw;
+                ;
             }
         }
