[Survived] Statement mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:9:1
 
 var builder = WebApplication.CreateBuilder(args);
 
-Env.Load();
+;
 //google
 builder.Configuration["Authentication:Google:ClientId"] = Environment.GetEnvironmentVariable("GOOGLE_CLIENT_ID");

[Survived] String mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:12:98
 Env.Load();
 //google
 builder.Configuration["Authentication:Google:ClientId"] = Environment.GetEnvironmentVariable("GOOGLE_CLIENT_ID");
-builder.Configuration["Authentication:Google:ClientSecret"] = Environment.GetEnvironmentVariable("GOOGLE_CLIENT_SECRET");
+builder.Configuration["Authentication:Google:ClientSecret"] = Environment.GetEnvironmentVariable("");
 //jwt
 builder.Configuration["JWT:SecretKey"] = Environment.GetEnvironmentVariable("JWT_SECRET_KEY");

[Survived] String mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:12:23
 Env.Load();
 //google
 builder.Configuration["Authentication:Google:ClientId"] = Environment.GetEnvironmentVariable("GOOGLE_CLIENT_ID");
-builder.Configuration["Authentication:Google:ClientSecret"] = Environment.GetEnvironmentVariable("GOOGLE_CLIENT_SECRET");
+builder.Configuration[""] = Environment.GetEnvironmentVariable("GOOGLE_CLIENT_SECRET");
 //jwt
 builder.Configuration["JWT:SecretKey"] = Environment.GetEnvironmentVariable("JWT_SECRET_KEY");

[Survived] String mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:14:77
 builder.Configuration["Authentication:Google:ClientId"] = Environment.GetEnvironmentVariable("GOOGLE_CLIENT_ID");
 builder.Configuration["Authentication:Google:ClientSecret"] = Environment.GetEnvironmentVariable("GOOGLE_CLIENT_SECRET");
 //jwt
-builder.Configuration["JWT:SecretKey"] = Environment.GetEnvironmentVariable("JWT_SECRET_KEY");
+builder.Configuration["JWT:SecretKey"] = Environment.GetEnvironmentVariable("");
 
 // Configurar CORS

[Survived] Statement mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:17:1
 builder.Configuration["JWT:SecretKey"] = Environment.GetEnvironmentVariable("JWT_SECRET_KEY");
 
 // Configurar CORS
-builder.Services.AddCors(options =>
-{
-    options.AddPolicy("AllowAll",
-        builder => builder
-            .AllowAnyOrigin()
-            .AllowAnyMethod()
-            .AllowAnyHeader());
-});
+;
 
 builder.Services.AddHttpClient();

[Survived] Statement mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:19:5
 // Configurar CORS
 builder.Services.AddCors(options =>
 {
-    options.AddPolicy("AllowAll",
-        builder => builder
-            .AllowAnyOrigin()
-            .AllowAnyMethod()
-            .AllowAnyHeader());
+    ;
 });
 

[Killed] Statement mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:26:1
             .AllowAnyHeader());
 });
 
-builder.Services.AddHttpClient();
+;
 
 builder.Services.AddControllers();
killedBy: pyWeb_ScaeUPT.Tests.Integration.IntegrationTests.Post_AuthGoogle_ReturnsBadRequestForInvalidToken

[Survived] Statement mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:38:1
 //     ));
 
 
-builder.Services.AddDbContext<pyWeb_ScaeUPT.Data.ApplicationDbContext>(options =>
-    options.UseMySql(
-        Environment.GetEnvironmentVariable("MYSQL_CONNECTION_STRING"),
-        ServerVersion.AutoDetect(Environment.GetEnvironmentVariable("MYSQL_CONNECTION_STRING"))
-    ));
+;
 
 

[NoCoverage] String mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:41:69
 builder.Services.AddDbContext<pyWeb_ScaeUPT.Data.ApplicationDbContext>(options =>
     options.UseMySql(
         Environment.GetEnvironmentVariable("MYSQL_CONNECTION_STRING"),
-        ServerVersion.AutoDetect(Environment.GetEnvironmentVariable("MYSQL_CONNECTION_STRING"))
+        ServerVersion.AutoDetect(Environment.GetEnvironmentVariable(""))
     ));
 

[Killed] String mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:46:52
 
 
 // Leer valores de configuración para JWT
-var secretKey = Environment.GetEnvironmentVariable("JWT_SECRET_KEY");
+var secretKey = Environment.GetEnvironmentVariable("");
 var issuer = builder.Configuration["JWT:Issuer"];
 var audience = builder.Configuration["JWT:Audience"];
killedBy: pyWeb_ScaeUPT.Tests.Integration.IntegrationTests.Get_HomeEndpoint_ReturnsSuccessAndCorrectContentType; pyWeb_ScaeUPT.Tests.Integration.IntegrationTests.Get_EstudianteEndpoint_ReturnsNotFoundForInvalidId; pyWeb_ScaeUPT.Tests.Integration.IntegrationTests.Get_EstudianteEndpoint_ReturnsSuccessForValidId

[Killed] Statement mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:51:1
 var audience = builder.Configuration["JWT:Audience"];
 
 // ✅ Configurar autenticación JWT
-builder.Services.AddAuthentication(options =>
-{
-    options.DefaultAuthenticateScheme = JwtBearerDefaults.AuthenticationScheme;
-    options.DefaultChallengeScheme = JwtBearerDefaults.AuthenticationScheme;
-})
-.AddJwtBearer(options =>
-{
-    options.TokenValidationParameters = new TokenValidationParameters
-    {
-        ValidateIssuer = true,
-        ValidateAudience = true,
-        ValidateLifetime = true,
-        ValidateIssuerSigningKey = true,
-
-        ValidIssuer = issuer,
-        ValidAudience = audience,
-        IssuerSigningKey = new SymmetricSecurityKey(Encoding.UTF8.GetBytes(secretKey))
-    };
-});
+;
 
 // Agregar autorización
killedBy: pyWeb_ScaeUPT.Tests.Integration.IntegrationTests.Get_ValidateToken_ReturnsUnauthorizedWithoutToken

[Survived] Block removal mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:52:1
 
 // ✅ Configurar autenticación JWT
 builder.Services.AddAuthentication(options =>
-{
-    options.DefaultAuthenticateScheme = JwtBearerDefaults.AuthenticationScheme;
-    options.DefaultChallengeScheme = JwtBearerDefaults.AuthenticationScheme;
-})
+{})
 .AddJwtBearer(options =>
 {

[Survived] Boolean mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:60:26
 {
     options.TokenValidationParameters = new TokenValidationParameters
     {
-        ValidateIssuer = true,
+        ValidateIssuer = false,
         ValidateAudience = true,
         ValidateLifetime = true,

[Survived] Boolean mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:61:28
     options.TokenValidationParameters = new TokenValidationParameters
     {
         ValidateIssuer = true,
-        ValidateAudience = true,
+        ValidateAudience = false,
         ValidateLifetime = true,
         ValidateIssuerSigningKey = true,

[Survived] Boolean mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:62:28
     {
         ValidateIssuer = true,
         ValidateAudience = true,
-        ValidateLifetime = true,
+        ValidateLifetime = false,
         ValidateIssuerSigningKey = true,
 

[Survived] Boolean mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:63:36
         ValidateIssuer = true,
         ValidateAudience = true,
         ValidateLifetime = true,
-        ValidateIssuerSigningKey = true,
+        ValidateIssuerSigningKey = false,
 
         ValidIssuer = issuer,

[Survived] Statement mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:72:1
 });
 
 // Agregar autorización
-builder.Services.AddAuthorization();
+;
 
 var app = builder.Build();

[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:77:5
 var app = builder.Build();
 
 // Middleware pipeline
-if (!app.Environment.IsDevelopment())
+if (app.Environment.IsDevelopment())
 {
     app.UseExceptionHandler("/api/Home/error");

[Survived] Statement mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:79:5
 // Middleware pipeline
 if (!app.Environment.IsDevelopment())
 {
-    app.UseExceptionHandler("/api/Home/error");
+    ;
     app.UseHsts();
 

[Survived] Statement mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:80:5
 if (!app.Environment.IsDevelopment())
 {
     app.UseExceptionHandler("/api/Home/error");
-    app.UseHsts();
+    ;
 
 }

[Survived] Statement mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:86:1
 
 app.UseHttpsRedirection();
 app.UseStaticFiles();
-app.UseCors("AllowAll");
+;
 
 app.UseRouting();

[Survived] String mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:86:13
 
 app.UseHttpsRedirection();
 app.UseStaticFiles();
-app.UseCors("AllowAll");
+app.UseCors("");
 
 app.UseRouting();

[Survived] Statement mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:88:1
 app.UseStaticFiles();
 app.UseCors("AllowAll");
 
-app.UseRouting();
+;
 
 app.UseAuthentication();

[Survived] Statement mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:94:1
 app.UseAuthorization();
 
 app.MapControllers();
-app.MapFallbackToFile("index.html"); //para malass reedirecciones
+; //para malass reedirecciones
 
 app.Run();

[Survived] String mutation
TestingRepo/WebApp/pyWeb_ScaeUPT/Program.cs:94:23
 app.UseAuthorization();
 
 app.MapControllers();
-app.MapFallbackToFile("index.html"); //para malass reedirecciones
+app.MapFallbackToFile(""); //para malass reedirecciones
 
 app.Run();
